In [1]:
import pandas as pd

In [2]:
seria = pd.Series([2,3,4,5,4,3,3,54,6,1])

In [6]:
seria[seria>5]

7    54
8     6
dtype: int64

In [9]:
df = pd.DataFrame({
    "Imię": ["Anna", "Bartek", "Celina"],
    "Wiek": [23, 30, 27],
    "Miasto": ["Kraków", "Warszawa", "Gdańsk"]
})

In [10]:
df

     Imię  Wiek    Miasto
0    Anna    23    Kraków
1  Bartek    30  Warszawa
2  Celina    27    Gdańsk

In [13]:
df.index = df.index + 1

In [14]:
df

     Imię  Wiek    Miasto
1    Anna    23    Kraków
2  Bartek    30  Warszawa
3  Celina    27    Gdańsk

In [ ]:
print(df.loc[1])
print(df.iloc[1])
# print(df["Imię"][1])

Imię        Anna
Wiek          23
Miasto    Kraków
Name: 1, dtype: object
Imię        Bartek
Wiek            30
Miasto    Warszawa
Name: 2, dtype: object
Anna